{"data":{"site":{"siteMetadata":{"title":"Blog","author":"Roy Lee"}},"markdownRemark":{"id":"2c2ccc09-f556-5151-a4de-45ac75508dfe","excerpt":"Woke up early today and did the laundry. The weather here is absolutely perfect for drying clothes. Even the jeans were dried by afternoon. Moving forward, I…","html":"<p>Woke up early today and did the laundry. The weather here is absolutely perfect for drying clothes. Even the jeans were dried by afternoon.</p>\n<p>Moving forward, I took a train to Sukhumvit in search of a burger place named “Daniel Thaiger”. The long walk coupled with the hot sun is certainly not the best combination. What’s worst is I came out empty handed for the first time. No water bottle, no bag, no nothing. So it was kinda risky because one might get a heatstroke anytime.</p>\n<p>Walked about 15-20 mins to reach the restaurant. The ambience is pretty chill and the drinks menu is rather interesting. Most importantly, I felt that the burger was pretty decent.</p>\n<blockquote>\n<p>The upside is that the burger taste great and hits the right spots. The downside is that the portion was small.</p>\n</blockquote>\n<p>But it is somewhat better than your average burger you’d have elsewhere. The price is about 365 baht after taxes. So if you’re prepared to pay about $15 SGD for a single burger, you can consider this outlet.</p>\n<p>Proceeded to get my bottle of water in the nearest convenient store. Please, please, please do remember to hydrate yourself because the water loss throughout your journey cannot be underestimated! I cannot understand how some people can wear a jacket and walk long distances under this kind of weather. Won’t your insides be cooked??? But you do you. I just cannot wrap this around me head.</p>\n<p>Wanted to take a taxi and go back to Sukhumvit MRT but decided to walk instead. Remember, 15 mins walk to your destination is also a 15 mins walk back if you’re going by foot. So if you’re going with a partner, make sure both of y’all can take it.</p>\n<p>It was a good call to walk as I found the massage place that I was searching for on Day 1. The place is called Health Land. It’s an extremely clean place for massage. The prices are slightly above average compared to those outlets on the streets.</p>\n<p>I got changed and proceeded with the 1 hour massage. It was very relaxing and I actually fell asleep midway. The masseur was great with his techniques and gave me some advices too. It was certainly worth the trip to Health Land. I definitely recommend this place if you’re looking for legit massage in Bangkok. Will come here again and try the more expensive package next time!</p>\n<p>Once the massage was over, I walked to Sukhumvit MRT and took a train to Thailand Cultural Center. Destination in mind was Ratchada Rot Fai Train Night Market. I walked past Esplanade shopping mall and decided to take a look inside. Its your everyday shopping mall, but larger. There’s a cinema upstairs and I was really tempted to watch Avengers: Endgame. The subtitles were in Thai, so that’s the only bummer for me. Will go back to Singapore and watch it with my parents instead!</p>\n<p>Went to the night market in early evening. Quite a few stalls weren’t even open yet.</p>","frontmatter":{"title":"Bangkok Trip Day 4","date":"April 24, 2019","description":"Long walks and massage"}}},"pageContext":{"isCreatedByStatefulCreatePages":false,"slug":"/thailand-trip-day-4/","previous":{"fields":{"slug":"/thailand-trip-day-3/"},"frontmatter":{"title":"Bangkok Trip Day 3"}},"next":null}}