{"data":{"site":{"siteMetadata":{"title":"Blog","author":"Roy Lee"}},"markdownRemark":{"id":"9551276b-1c05-5415-8a11-59dec6769467","excerpt":"Went to Chatuchak about 9am in the morning. Grabbed a quick fried rice for breakfast. They have interesting translation for their menu. Walked wayyyy too many…","html":"<p>Went to Chatuchak about 9am in the morning. Grabbed a quick fried rice for breakfast. They have interesting translation for their menu.</p>\n<p>Walked wayyyy too many steps at Chatuchak. Bought many stuffs at a cheap price(yay) for family and myself. Notable stuffs include a pair of boots and a cardigan. Many stores did not carry OnePlus 6 accessories, which is sad.</p>\n<p>Had coconut ice cream as well. It is probably one of the “must-have” if you are at Chatuchak Weekend Market.</p>\n<p>There was a promotion where promoters were giving out free ice cold sugarless Pepsi drinks in the sorching hot day. A very refreshing drink if you have been walking for too long.</p>\n<p>Went to visit the Victory Monument. Did not physically went down to visit the monument, but took photos of it from the bridge across it. It was quite the sight.</p>\n<p>Had lunch at Rue Thong Boat Noodle place. It serves bite-sized bowls of noodles for cheap! You can try different flavours of their noodles as one is simply not enough. People over there stack bowls and bowls on their table. Some even going up to 10s and 20s of it! I had 3 and called it a day. It was great! But wasn’t feelng very hungry (weird because I’ve walked about 20000 steps in Chatuchak).</p>\n<hr>\n<p>Interesting events:\nI was guided to seat with a local in the restaurant. After her food came, as she was eating it, she had a bit of runny nose. So I offered her some tissues. Now, while I was eating my noodles, I wanted to order a drink. However, she offered to buy me a drink instead! I thanked her and she left before I finished my meal.</p>\n<p>While returning back to hotel, as I was in the train, a female tourist fainted in the middle of the train ride. Her eyes literally rolled back and she collapsed like a dead weight. Her boyfriend tried to lift her up but she wasn’t responding. After about 15 seconds later, she got up and sat on a seat. A local offered her some oilment for her to apply.</p>\n<p>PSA: Heat injury is real. Please remember to drink up every so often! Especially when the weather over here is socrching hot and you’ve lost plenty of water throughout the day.</p>\n<p>Overall, the locals over here are very nice! Taxi drivers as well! Even though there’s some language barrier, but we still get to communicate through basic English and hand signs!</p>\n<hr>\n<p>Went back to hotel to put down all my loots for the day. Proceed to work on some freelance projects all the way from 6pm to 10pm. Mind you, I have not had dinner yet. Wanted to get something simple to eat nearby but there was no stores around the vicinity of my accomodation.</p>\n<p>So I took a train to Sukhumvit, in hopes of finding a decent place with decent food. Went to Terminal 21 shopping mall, only to find out their stores in the mall are all closed. No surprise. Went down the lane and got myself in the alley of the Devil’s Playground. They have bars and clubs along this alley. But not a single restaurant which specialise in serving food. Grabbed a piece of Alfredo pizza outside one of the bar and ate it. Afterwards, I randomly picked a bar with a live band and got myself a Long Island. They have a food menu which was still serving late at this timing, which is different from Singapore’s last order timing at a bar. Got myself a sphagetti and settled with that for dinner. Had one last Jägermeister and called it a night. Took a taxi back to hotel.</p>\n<p>Might have went slightly over the budget for Day 1. But that’s taking into account that most of the shopping for the entire trip is done in Chatuchak weekend market. As per my previous 2 experiences in Bangkok, most of the things they sell are very repetitive, even in a couple of MRT Stations away. It’s mostly what you have seen in Chatuchak. Everything else is either international brand or extremely niche hipster goods.</p>\n<p>Probably will chillout a bit more for Day 2.</p>","frontmatter":{"title":"Bangkok Trip Day 1","date":"April 21, 2019","description":"See, eat, drink, shop at the heart of Thailand."}}},"pageContext":{"isCreatedByStatefulCreatePages":false,"slug":"/thailand-trip-day-1/","previous":{"fields":{"slug":"/thailand-trip-day-0/"},"frontmatter":{"title":"Bangkok Trip Day 0"}},"next":{"fields":{"slug":"/thailand-trip-day-2/"},"frontmatter":{"title":"Bangkok Trip Day 2"}}}}