{"data":{"site":{"siteMetadata":{"title":"Blog","author":"Roy Lee"}},"markdownRemark":{"id":"8a95b317-cd9a-5dad-8c14-ce244ad9e442","excerpt":"Woke up and walked around the accomodation vicinity in search for breakfast. Yea, it might sound crazy I know, but this is my first time walking in the opposite…","html":"<p>Woke up and walked around the accomodation vicinity in search for breakfast. Yea, it might sound crazy I know, but this is my first time walking in the opposite direction of the train station in 3 days.</p>\n<p>Found a small store selling meatball noodles and grabbed one of the beef bowl for 50 Baht. The taste was pretty decent,albeit the portion was a bit small (just slightly bigger than the Boat Noodle I had near Victory Monument on Day 1). Grabbed a Cha Yen (Milk Tea) with pearl for 25 Baht and called a Grab to head to the Grand Palace.</p>\n<p>During the taxi ride, the driver recommended me to go to Wat Pho instead for 3 reasons.</p>\n<ol>\n<li>The weather is extremely hot.</li>\n<li>It is a hotspot for tourist, so I’ll probably need to queue for a long while.</li>\n<li>The entrance fee is about 400-500 baht.</li>\n<li>It closes at 3pm.\nI was also told that if I really want to, I can visit the Grand Palace after touring Wat Pho Temple!\nSo I did and went to Wat Pho first instead. There were quite some tourists but the queue is almost non-existent because the entrance ticket is 200 baht and you can proceed right in without bag check.</li>\n</ol>\n<p>The interior of the temple looks great! There were plenty of Monk/Buddha statues. The buildings and architectures are unique and beauty! Makes you wonder how did they do it and the significance behind them. Well, if you want to, you can probably pay a couple of hundred bahts for a tour guide, or simply enjoy and appreciate the beauty of those artifacts in the moment and Google it at your free time. (Yes I went in blindly not knowing what to expect.)</p>\n<p>Deep inside the temple lies the world largest reclining Buddha.\nExtract from Wikipedia:</p>\n<blockquote>\n<p>A reclining Buddha is a statue that represents Buddha lying down and is a major iconographic and statuary pattern of Buddhism.It represents the historical Buddha during his last illness, about to enter the parinirvana.\nInside here, you’ll need to take your shoes and put it in a plastic bag provided. Inside this hall you can see the enormous statue of the reclining Buddha stretching from head to toe. I did not have any dedicated camera with me to capture this beauty, so I just had to do with my trusty OnePlus 6.</p>\n</blockquote>\n<p>Be prepared for spoilers if you have yet to travel there before!! This is my own experience, takeaway and lesson from the following activity. If you want to experience it on your own, skip the below!</p>\n<div class=\"gatsby-highlight\" data-language=\"text\"><pre class=\"language-text\"><code class=\"language-text\">One activity to do inside this hall was &quot;Coin Dropping&quot;. You simply have to pay 20 baht and the staff will pass you a bowl full of coins.\n\nYou need to drop those coins into the many bowls which stretched across the length of the hall. How you provision your coins to each bowl was entirely up to you. Again, as I mentioned, I went in blindly, not knowing what to expect.\n\nSo initially, I grabbed a couple of coins at the start and dropped them into the first bowl. I did that because I looked at my bowl of coins and compared it with all the bowls in the hall and thought to myself: &quot;There&#39;s plenty of coins enough for all of the bowls in this hall.&quot;\n\nAnd then this is where the fun begins. The satisfying sound of the coins dropping into the bowl, the action of dropping those coins, it was quite fun to me! It&#39;s like a &quot;touristy&quot; thing one would do over there. But as I gradually reach the bowl in the middle of the stretch, I realised, my coins were not sufficient for the rest of the journey. I switched from my dropping &quot;a couple of coins&quot; to &quot;two coins per bowl&quot;.\n\nIt was an improvement. I can last a few more bowls than what I could do with my old technique.</code></pre></div>\n<p>Temple visit\nGrab Bike experience</p>","frontmatter":{"title":"Bangkok Trip Day 3","date":"April 23, 2019","description":""}}},"pageContext":{"isCreatedByStatefulCreatePages":false,"slug":"/thailand-trip-day-3/","previous":{"fields":{"slug":"/thailand-trip-day-2/"},"frontmatter":{"title":"Bangkok Trip Day 2"}},"next":null}}