{"data":{"site":{"siteMetadata":{"title":"Blog","author":"Roy Lee"}},"markdownRemark":{"id":"62ba7a73-62d8-5e88-ab1c-6497d866601e","excerpt":"Slept in in the morning till 10am. Felt very well rested. Did not rushed to go anywhere. Got washed up and set off to Siam in the noon to shop and eat. Upon…","html":"<p>Slept in in the morning till 10am. Felt very well rested. Did not rushed to go anywhere. Got washed up and set off to Siam in the noon to shop and eat.</p>\n<p>Upon reaching Siam Discovery, got called up by my client to do some work. Didn’t bring my laptop out with me and had to settle with using a phone. Got some of it rectified and told him I’d finish the rest when I get back.</p>\n<p>Went to MBK and looked around the stores they had in this large shopping mall. Bought a full screen tempered glass protector for 200 baht. Lady was kind enough to give me a discount when every other stores nearby were selling at 250-300 baht.</p>\n<p>Went to have lunch at Katsuya. Double cheese fried chicken rice was on the menu and I was sold. It turned out ok. Wasn’t the best but definitely not the worst. Continued walking around the stores and bought myself a inflatable bunny ear hat for 199 baht! It was the one Rosa Salazar (actress of Alita) was wearing when she was in Korea! It looked really really cute!</p>\n<p>Went upstairs and got myself a Thai Iced Milk Tea by Cha Tra Mue. An original local Thai tea shop. To be honest, it was a little too sweet for me (for someone who have sweet tooth). If you’re getting one for yourself, you can probably try another flavour!</p>\n<p>Walked past an anime shop and damn, they really sell a lot of anime merchandise! It’s like a happy place for weebs (yes, I’m an ocasional nerd/weeb). Asked them for Gunnm/Alita merch but they told me they only have 2 mangas. A volumne of the main arc and a volume of Last Order. A bit dissapointed, frankly. Ended up buying OnePiece merch for my brother! Those merchs look pretty sick!</p>\n<p>Went back to accomodations to put my things down and got to work. Watched Game Of Thrones too. A little whiskey with Game Of Thrones will never go wrong. It was the perfect evening. Having a paid assignment while you’re travelling essentially means you’re travelling for free (yes, you still pay for it. But at least it cushion some of your expenses). Admittedly, no one likes their holiday to be interrupted with work. But I came here to do what I like. Eat, drink, shop, see, work; these amount to pretty much what I have in mind! Besides, I brought my laptop overseas for a reason.</p>\n<p>Should probably spend more time outside for Day 3!</p>\n<h3>PSA</h3>\n<blockquote>\n<p>If you’re watching Game Of Thrones, please do not skip their opening. Please enjoy the music but more importantly, pay attention to the opening scene. It tells a story on its own (as it has always been).</p>\n</blockquote>\n<p>Watch S08E01 and S08E02 opening scenes and find the difference. You’ll thank me later.</p>","frontmatter":{"title":"Bangkok Trip Day 2","date":"April 22, 2019","description":"Free holiday?!?"}}},"pageContext":{"isCreatedByStatefulCreatePages":false,"slug":"/thailand-trip-day-2/","previous":{"fields":{"slug":"/thailand-trip-day-1/"},"frontmatter":{"title":"Bangkok Trip Day 1"}},"next":null}}